<?php

return [
    'DASHBOARD_DATE_RANGE' => [
        '1' => '７日',
        '2' => '３０日',
        '3' => '９０日',
        '4' => '１３か月',
        '5' => '２５か月',
        '0' => 'カレンダー選択'
    ],
    'DASHBOARD_CHART_TYPE' => [
        '0' => '検索数合計',
        '1' => '検索数内訳',
        '2' => '検索数比率',
        '3' => 'アクション数内訳',
        '4' => 'アクション数比率',
        '5' => 'アクション数比率(対検索数合計)'
    ],
    // -------------------------------------------------------------------------
    'rate' => [
        '1' => '★☆☆☆☆',
        '2' => '★★☆☆☆',
        '3' => '★★★☆☆',
        '4' => '★★★★☆',
        '5' => '★★★★★'
    ],
    'replyStatus' => [
        '0' => '未',
        '1' => '済'
    ],
    'syncStatus' => [
        '1' => '下書き',
        '2' => '予約済み',
        '3' => '同期失敗',
        '4' => '一部同期失敗',
        '5' => '同期済'
    ],
    'REPLY_TIME_RANGE' => [
        '00:00' => '　０時～３時',
        '03:00' => '　３時～６時',
        '06:00' => '　６時～９時',
        '09:00' => '　９時～１２時',
        '12:00' => '１２時～１５時',
        '15:00' => '１５時～１８時',
        '18:00' => '１８時～２１時',
        '21:00' => '２１時～２４時'
    ],
    'FLG_ON'  => '1',
    'PAGINATE_MAX_LIMIT'  => '15',
    'TEMP_USER_ID' => '1234567890',
    'IS_AUTO_REPLY' => [
        '0' => '手動返信',
        '1' => '自動返信'
    ],
    'reviewAutoReplied' => [
        '0' => '自動返信停止',
        '1' => 'すべてに自動返信',
        '2' => 'コメントなしのみ自動返信'
    ],
    // -------------------------------------------------------------------------
    'LOCAL_POST_SYNC_STATUS' => [
        'DRAFT' => '下書き',
        'QUEUED' => '予約済み',
        'FAILED' => '同期失敗',
        'CANCEL' => '一部同期失敗',
        'SYNCED' => '同期済み'
    ],
    'GMB_TOPIC_TYPE' => [
        'LOCAL_POST_TOPIC_TYPE_UNSPECIFIED' => '未設定',
        'STANDARD' => '最新情報',
        'EVENT' => 'イベント',
        'OFFER' => '特典'
    ],
    'GMB_TOPIC_TYPE_WITHOUT_UNSPECIFIED' => [
        // 「未設定」の選択肢が不要な場合に使用する
        'STANDARD' => '最新情報',
        'EVENT' => 'イベント',
        'OFFER' => '特典'
    ],
    'GMB_ACTION_TYPE' => [
        'ACTION_TYPE_UNSPECIFIED' => 'なし',
        'BOOK' => '予約',
        'ORDER' => 'オンライン注文',
        'LEARN_MORE' => '詳細',
        'SIGN_UP' => '登録',
        'CALL' => '電話する'
    ],
    'GMB_MEDIA_FORMAT' => [
        'MEDIA_FORMAT_UNSPECIFIED' => '未設定',
        'PHOTO' => '写真',
        'VIDEO' => '動画',
    ],
    // -------------------------------------------------------------------------
    // 投稿時間帯の選択用（スタート時刻をキーとする）
    'POST_TIME_RANGE' => [
        '00:00' => '　０時～３時',
        '03:00' => '　３時～６時',
        '06:00' => '　６時～９時',
        '09:00' => '　９時～１２時',
        '12:00' => '１２時～１５時',
        '15:00' => '１５時～１８時',
        '18:00' => '１８時～２１時',
        '21:00' => '２１時～２４時',
    ],
    'POSTAL_REGEONS' => [
        'JA' => '日本',
    ],
    'POSTAL_PREFS' => [
        '北海道','青森県','岩手県','宮城県','秋田県','山形県','福島県','茨城県','栃木県','群馬県','埼玉県','千葉県','東京都','神奈川県','新潟県','富山県','石川県','福井県','山梨県','長野県','岐阜県','静岡県','愛知県','三重県','滋賀県','京都府','大阪府','兵庫県','奈良県','和歌山県','鳥取県','島根県','岡山県','広島県','山口県','徳島県','香川県','愛媛県','高知県','福岡県','佐賀県','長崎県','熊本県','大分県','宮崎県','鹿児島県','沖縄県'
    ],
    'PHOTO_CATEGORY' => [
        'CATEGORY_UNSPECIFIED' => 'カテゴリーなし',
        'COVER' => 'カバー',
        'PROFILE' => 'プロフィール',
        'LOGO' => 'ロゴ',
        'EXTERIOR' => '外観',
        'INTERIOR' => '店内',
        'PRODUCT' => '商品',
        'AT_WORK' => '職場',
        'FOOD_AND_DRINK' => '食品と飲料',
        'MENU' => 'メニュー',
        'COMMON_AREA' => '共有エリア',
        'ROOMS' => '客室',
        'TEAMS' => 'チーム',
        'ADDITIONAL' => '追加'
    ],
    'PHOTO_SYNC_STATUS' => [
        '1' => '下書き',
        '2' => '予約済み',
        '3' => '同期失敗',
        '4' => '一部同期失敗',
        '5' => '同期済み'
    ],
    'FORMAT_DATE_YMD' => 'Y/m/d',
    'FORMAT_DATE_MD' => 'm/d',
    'FORMAT_DATETIME_YMDHIS' => 'Y-m-d H:i:s',
    'FORMAT_DATETIME_YMDHI' => 'Y-m-d H:i', // 投稿予約の日時指定などで使用
    'FORMAT_DATETIME_MDHI' => 'm/d H:i',
    'FORMAT_TIME_HI' => 'H:i',
    // Session , Cookie 関連
    'SESSION_MY_BRAND' => 'gmb_manager_my_brand',
    'SESSION_MY_BRAND_TTL' => 20160,    // minutes (20160 = 14日間)
    'SESSION_MY_ROLE' => 'gmb_manager_my_role',
    'SESSION_CONTRACT_TYPE' => 'contract_type',
    'PARAWORKS_ENTERPRISE_ID' => 1, // パラワークス所属か？の判定用。enterprises.enterprise_id をセットする。通常は1。
];
